PIVOT_HEADER = [
    {"name": "Комментарий", "width": 30},
    {"name": "Количество в ЗИП на 3 год", "width": 20},
    {"name": "Количество в ЗИП на 1 год", "width": 20},
    {"name": "Количество в оборудовании установлено", "width": 20},
    {"name": "Альтернативный партномер", "width": 20},
    {"name": "Партномер", "width": 20},
    {"name": "Наименование компоненты на русском яз", "width": 35},
    {"name": "Описание компоненты на англ яз", "width": 70},
]

MAIN_HEADER = {
    "Тип": 20,
    "Модель/партномер": 25,
    "Количество": 15,
    "Серийный номер": 20,
    "Описание компоненты на англ яз": 70,
    "Наименование компоненты на русском яз": 35,
    "Партномер": 20,
    "Альтернативный партномер": 20,
    "Количество в оборудовании установлено": 20,
    "Комментарий": 30,
}

HEADER_WIDTH = [
    PIVOT_HEADER[0]["width"],
    *[val["width"] for val in PIVOT_HEADER[3:]],
    20,
    10,
    25,
    20,
]
CURRENT_SHEET_NAME = "Разбивка по серверам"
NEW_SHEET_NAME = "Сводная таблица"

JSON_FILE_NAME = "json_conf.xlsx"

SERVICE_TIME = {
    'Количество в ЗИП на 1 год': 365,
    'Количество в ЗИП на 3 года': 365*3
}
